timetracking/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" ORDER BY "projects"."created_at" DESC LIMIT 10
---
  def index
      @projects = Project.last_created_projects(10)
      if @projects.empty?

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", "10"]]
---
  def show
    #@project = Project.find params[:id]
    #rescue ActiveRecord::RecordNotFound
    #  render 'no_projects_found'
    unless @project = Project.find_by(id: params[:id])